Service/app/Controllers/BooksController.php

    public function index()
    {
        $model = new BookModel();
        $data['books'] = $model->findAll();  // Fetching all books from the database
---
SELECT *
FROM "books"

    public function toggleAvailability($id = null)
    {
        $model = new BookModel();
        $book = $model->find($id);
---
SELECT *
FROM "books"
WHERE "books"."id" = '1'